
     ####################################################################################################################################################################
    ######################################################################################################################################################################
   ########################################################################################################################################################################
  ##########################################################################################################################################################################
 ############################################################################################################################################################################
##############################################################################################################################################################################
#                                                                                                                                                                            #
#                                                                           !!!НАСТРОЙКА ДОПОЛНИТЕЛЬНЫХ ПАКЕТОВ!!!                                                           #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
################################################################################!!!УСТАНОВКА СИСТЕМНЫХ УТИЛИТ!!!##############################################################
##############################################################################################################################################################################
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#!sudo pacman -S gparted #Уберите "#!" в самом начале этой строки, если вам нужен GParted                                                                                    #
##############################################################################################################################################################################
#Описание:                                                                                                                                                                   #
#GParted - это программа для создания, изменения и удаления дисковых разделов.                                                                                               #
#GParted позволяет изменять организацию разделов на дисковых устройствах без потери данных.                                                                                  #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#!yay -S stacer-bin #Уберите "#!" в самом начале этой строки, если вам нужен Stacer                                                                                          #
##############################################################################################################################################################################
#Описание:                                                                                                                                                                   #
#Stacer — это оптимизатор системы и монитор приложений с открытым исходным кодом, который помогает пользователям управлять всей системой с различных аспектов.               #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#!yay -S etcher-bin #Уберите "#!" в самом начале этой строки, если вам нужен balenaEtcher                                                                                    #
##############################################################################################################################################################################
#Описание:                                                                                                                                                                   #
#balenaEtcher или просто Etcher — утилита для создания загрузочных накопителей или записи ОС на SD карту.                                                                    #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
##############################################################################!!!УСТАНОВКА ПРИЛОЖЕНИЙ ДЛЯ СВЯЗИ!!!############################################################
##############################################################################################################################################################################
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#!sudo pacman -S telegram-desktop #Уберите "#!" в самом начале этой строки, если вам нужен Telegram                                                                          #
##############################################################################################################################################################################
#Описание:                                                                                                                                                                   #
#Telegram — это продвинутый мессенджер, система мгновенного обмена сообщениями, в котором можно прислать текст, видео, аудио, а также стикеры, фотографии и крупные файлы.   #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#!sudo pacman -S ayugram-desktop-bin #Уберите "#!" в самом начале этой строки, если вам нужен Ayugram                                                                        #
##############################################################################################################################################################################
#Описание:                                                                                                                                                                   #
#Ayugram — это приложение для обмена сообщениями и социальной сети. Из названия ясно, что что-то их связывает с Telegram (так и есть).                                       # 
#Ayugram основан на базе Telegram, по сути им и является, но с расширенным функционалом.                                                                                     #
#                                                                                                                                                                            #
#ПРЕДУПРЕЖДЕНИЕ!!!! Для запуска Ayugram нужно вводить в терминал ayugram-desktop, что является не привычным для большенства пользователей.                                   #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#!sudo pacman -S discord #Уберите "#!" в самом начале этой строки, если вам нужен Discord                                                                                    #
##############################################################################################################################################################################
#Описание:                                                                                                                                                                   #
#Discord — это бесплатный мессенджер, который позволяет вам обмениваться голосовым, видео и текстовым чатом с друзьями.                                                      # 
#У него сотни миллионов пользователей, что делает его одним из самых популярных способов общения с людьми в Интернете.                                                       #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#!sudo pacman -S element-desktop #Уберите "#!" в самом начале этой строки, если вам нужен Element                                                                            #
##############################################################################################################################################################################
#Описание:                                                                                                                                                                   #
#Element — это универсальный мессенджер основанный на Matrix, тоесть, реально анонимный (не обязательно использовать номер телефона или основную почту).                     #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################  
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
###################################################################################!!!ПРОДУКТИВНОСТЬ!!!######################################################################№
##############################################################################################################################################################################
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#!sudo pacman -S libreoffice-still && sudo pacman -S libreoffice-ru #Уберите "#!" в самом начале этой строки, если вам нужен libreoffice                                     #
##############################################################################################################################################################################
#Описание:                                                                                                                                                                   #
#LibreOffice включает в себя несколько приложений и это делает его самым мощным бесплатным пакетом офисных программ с открытым исходным кодом на рынке.                      #
#В установку входит стабильная версия LibreOffice + русификатор                                                                                                              #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#!flatpak install flathub md.obsidian.Obsidian #Уберите "#!" в самом начале этой строки, если вам нужен Obsidian                                                             #
##############################################################################################################################################################################
#Описание:                                                                                                                                                                   #
#Obsidian — это Markdown (.md) редактор и приложение для ведения базы знаний.                                                                                                #
#В самом простом примере использования вы можете редактировать и просматривать Markdown (.md) файлы.                                                                         #
#Но истинная мощь кроется в управлении плотно сплетенными связями в базе знаний.                                                                                             #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################  
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
###################################################################################!!!ТОРРЕНТ КЛИЕНТЫ!!!######################################################################
##############################################################################################################################################################################
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#!sudo pacman -S transmission-gtk #Уберите "#!" в самом начале этой строки, если вам нужен Transmission                                                                      #
##############################################################################################################################################################################
#Описание:                                                                                                                                                                   #
#Transmission — простой BitTorrent-клиент c открытым исходным кодом.                                                                                                         #
#Transmission — свободное программное обеспечение, большей частью под лицензией GNU GPL с небольшими фрагментами под лицензией MIT.                                          #
#Transmission реализован как клиент-серверное приложение, он может быть интерактивной программой, взаимодействующей и с пользователем, и с сетью bittorrent,                 # 
#демоном без интерфейса взаимодействия с пользователем (с управлением извне), и управляющей демоном программой.                                                              #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#!sudo pacman -S qbittorrent #Уберите "#!" в самом начале этой строки, если вам нужен qBittorrent                                                                            #
##############################################################################################################################################################################
#Описание:                                                                                                                                                                   #
#В торрент-клиенте qBittorrent есть практически всё необходимое для удобной загрузки и раздачи файлов.                                                                       #
#Он поддерживает все возможности стандарта BitTorrent, вроде DHT и шифрования.                                                                                               #
#qBittorrent умеет самостоятельно искать раздачи. Изначально доступно десять трекеров, но их список можно расширить, в том числе российскими.                                #
#Для управления извне есть удобный веб-интерфейс. Клиент сворачивается в трей. Через иконку есть доступ к основным элементам управления.                                     #
#У файлов можно выставить приоритет, в том числе в алфавитном порядке, что будет полезно при скачивании сериалов.                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#!flatpak install flathub org.tribler.Tribler #Уберите "#!" в самом начале этой строки, если вам нужен Tribler                                                               #
##############################################################################################################################################################################
#Описание:                                                                                                                                                                   #
#Tribler – это не самый обычный клиент. Он позволяет скачивать файлы через цепочку серверов-посредников, подобно тому, как это происходит в сети Tor.                        #
#Вдобавок к этому у него есть большой список трекеров для поиска.                                                                                                            #
#Tribler может быть полезен при использовании мобильной сети (зачастую операторы не допускают использование сети BitTorrent и не пускают на сайты трекеров).                 #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################  
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#####################################################################################!!!РАЗРАБОТКА!!!#########################################################################
##############################################################################################################################################################################
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#!yay -S visual-studio-code-bin #Уберите "#!" в самом начале этой строки, если вам нужен VScode                                                                              #
##############################################################################################################################################################################
#Описание:                                                                                                                                                                   #
#Visual Studio Code (VS Code) — текстовый редактор, разработанный Microsoft для Windows, Linux и macOS.                                                                      #
#Позиционируется как «лёгкий» редактор кода для кроссплатформенной разработки веб и облачных приложений.                                                                     #
#Включает в себя отладчик, инструменты для работы с Git, подсветку синтаксиса, IntelliSense и средства для рефакторинга.                                                     #
#Имеет широкие возможности для кастомизации: пользовательские темы, сочетания клавиш и файлы конфигурации.                                                                   #
#Распространяется бесплатно, разрабатывается как программное обеспечение с открытым исходным кодом, но готовые сборки распространяются под проприетарной лицензией.          #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#!flatpak install flathub io.github.shiftey.Desktop #Уберите "#!" в самом начале этой строки, если вам нужен GitHub Desktop                                                  #
##############################################################################################################################################################################
#Описание:                                                                                                                                                                   #
#GitHub Desktop — это бесплатное приложение с открытым код, которое помогает работать с файлами, размещенными на GitHub или других службах размещения Git.                     #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#!flatpak install flathub com.google.AndroidStudio #Уберите "#!" в самом начале этой строки, если вам нужен AndroidStudio (Репозиторий flathub)                              #
#!yay -S android-studio #Уберите "#!" в самом начале этой строки, если вам нужен AndroidStudio (Репозиторий AUR)                                                             #
##############################################################################################################################################################################
#Описание:                                                                                                                                                                   #
#Android Studio — интегрированная среда разработки (IDE) для работы с платформой Android                                                                                     #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
##################################################################################!!!МУЗЫКАЛЬНЫЕ ПЛЕЕРЫ!!!####################################################################
##############################################################################################################################################################################
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#!sudo pacman -S rhythmbox #Уберите "#!" в самом начале этой строки, если вам нужен Rhythmbox                                                                                #
##############################################################################################################################################################################
#Описание:                                                                                                                                                                   #
#Rhythmbox — музыкальный проигрыватель для Linux и других UNIX-подобных операционных систем. Набор функций схож с таковым у Apple iTunes.                                    #
#Разработан специально для среды GNOME и использует GStreamer для вывода звука.                                                                                              #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#!flatpak install flathub io.bassi.Amberol #Уберите "#!" в самом начале этой строки, если вам нужен Amberol                                                                  #
##############################################################################################################################################################################
#Описание:                                                                                                                                                                   #
#Amberol - это музыкальный проигрыватель без мании величия.                                                                                                                  #
#Если вы просто хотите воспроизводить музыку, доступную в вашей локальной системе, то Amberol - это тот музыкальный проигрыватель, который вы ищете.                         #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#!flatpak install flathub dev.aunetx.deezer #Уберите "#!" в самом начале этой строки, если вам нужен Deezer                                                                  #
##############################################################################################################################################################################
#Описание:                                                                                                                                                                   #
#Deezer — французский интернет-сервис потоковой передачи музыки.                                                                                                             #
#Позволяет прослушивать музыкальные композиции разных лейблов звукозаписи, включая Universal Music Group, Sony Music и Warner Music Group,                                   #
#на различных устройствах в режиме онлайн или офлайн. В настоящее время в базе сервиса находятся более 90 миллионов музыкальных композиций и 34 000 радиостанций.            #
#Сервис насчитывает свыше 14 миллионов активных пользователей в месяц и 7 миллионов платных подписчиков.                                                                     #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#!sudo pacman -S lollypop #Уберите "#!" в самом начале этой строки, если вам нужен Lollypop                                                                                  #
##############################################################################################################################################################################
#Описание:                                                                                                                                                                   #
#Lollypop — это красиво оформленный графический музыкальный проигрыватель для настольных компьютеров GTK, такой как GNOME.                                                   #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#################################################################################!!!РЕШЕНИЕ ЗАПУСКА EXE!!!####################################################################
##############################################################################################################################################################################
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
#!flatpak install flathub ru.linux_gaming.PortProton #Уберите "#!" в самом начале этой строки, если вам нужен PortProton                                                     #
##############################################################################################################################################################################
#Описание:                                                                                                                                                                   #
#PortProton основан на версии WINE от Valve (Proton) и её модификациях (Proton GE).                                                                                          #
#Включает в себя набор скриптов в сочетании с самим WINE-PROTON, контейнером Steam Runtime Sniper с добавлением портированных версий MANGOHUD                                #
#(вывод полезной информации через окно игры: FPS, FrameTime, CPU, GPU и т.д.) и vkBasalt                                                                                     #
#(улучшение графики в играх, очень хорошо в сочетании с FSR, DLSS) + множество уже настроенных оптимизаций для максимальной производительности.                              #
#PortProton устанавливается в систему и позволяет запускать Windows-приложения в Linux-среде: не только игры, любое ПО.                                                      #
#Доступны для установки игровые клиенты, которые не имеют нативной поддержки GNU/Linux-систем и эмуляторы.                                                                   #
#                                                                                                                                                                            #
#                                                                                                                                                                            #
##############################################################################################################################################################################
 ############################################################################################################################################################################
  ##########################################################################################################################################################################
   ########################################################################################################################################################################
    ######################################################################################################################################################################
     ####################################################################################################################################################################

